TOKEN = '7365042699:AAGgUUB80u_v6SG5bVM8gdAqfx76zT4niB4'


ADMIN_CHAT_ID = '1420995622'


animals_data = {
    'Лев': {
        'description': 'Вы - Лев! Царь зверей, символ силы, мужества и благородства. '
                       'Люди-львы обычно обладают лидерскими качествами и харизмой... Подробнее https://moscowzoo.ru/animals/kinds/indiyskiy_lev',
        'image': 'https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/114939dc-d35b-4999-a317-9858875cf56c.jpeg',
        'sponsor_link': 'https://moscowzoo.ru/about/guardianship'
    },
    'Сова': {
        'description': 'Вы - Сова! Символ мудрости, терпения и проницательности. '
                       'Люди-совы ценят знания, обладают хорошей интуицией и наблюдательностью... Подробнее https://moscowzoo.ru/animals/kinds/ushastaya_sova',
        'image': 'https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/380f0859-78ba-463e-a7e5-daf7107e62aa.jpeg',
        'sponsor_link': 'https://moscowzoo.ru/about/guardianship'
    },
    'Енот': {
        'description': 'Вы - Енот! Символ дружелюбия, радости и интеллекта. '
                       'Люди-еноты общительны, творчески и обладают отличным чувством юмора... Подробнее https://moscowzoo.ru/animals/kinds/enot_poloskun',
        'image': 'https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/4442cefb-7195-445e-9070-f92a3f8baf63.jpg',
        'sponsor_link': 'https://moscowzoo.ru/about/guardianship'
    },
    'Волк': {
        'description': 'Вы - Волк! Символ верности, интуиции и независимости. '
                       'Люди-волки ценят семью и близких, обладают сильным характером... Подробнее https://moscowzoo.ru/animals/kinds/evropeyskiy_volk',
        'image': 'https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/a26086b0-53a3-452a-8552-5f5cef835879.jpg',
        'sponsor_link': 'https://moscowzoo.ru/about/guardianship'
    },
    'Слон': {
        'description': 'Вы - Слон! Символ мудрости, силы и долголетия. '
                       'Люди-слоны терпеливы, надежны и обладают отличной памятью...Подробнее https://moscowzoo.ru/animals/kinds/aziatskiy_slon.',
        'image': 'https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animalsdetail/4d5739da-89fa-4056-83ac-00e6bd409ad9.jpeg',
        'sponsor_link': 'https://moscowzoo.ru/about/guardianship'
    },
    'Орел': {
        'description': 'Вы - Орел! Символ свободы, дальновидности и духовности. '
                       'Люди-орлы амбициозны, проницательны и ценят независимость... Подробнее https://moscowzoo.ru/animals/kinds/stepnoy_orel',
        'image': 'https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/dd1fc6ee-2ff4-42f9-a775-c003bb9eae5b.jpg',
        'sponsor_link': 'https://moscowzoo.ru/about/guardianship'
    },
    'Черепаха': {
        'description': 'Вы - Черепаха! Символ устойчивости, терпения и мудрости. '
                       'Люди-черепахи методичны, надежны и умеют ждать подходящего момента...Подробнее https://moscowzoo.ru/animals/kinds/luchistaya_cherepaha',
        'image': 'https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/5583715a-3e34-4bd5-aab1-96ee50ed4af3.jpeg',
        'sponsor_link': 'https://moscowzoo.ru/about/guardianship'
    },
    'Пума': {
        'description': 'Вы - Пума! Символ хитрости, адаптивности и сообразительности. '
                       'Люди-пумы находчивы, наблюдательны и умеют находить выход из сложных ситуаций... Подробнее https://moscowzoo.ru/animals/kinds/puma',
        'image': 'https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animalsdetail/16a63756-3102-466a-af51-21ba87cd9369.jpeg',
        'sponsor_link': 'https://moscowzoo.ru/about/guardianship'
    },
    'Медведь': {
        'description': 'Вы - Медведь! Символ силы, защиты и уверенности. '
                       'Люди-медведи заботливы, решительны и обладают внутренней силой... Подробнее https://moscowzoo.ru/animals/kinds/buryy_medved',
        'image': 'https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/b535fefc-6867-497b-a278-05966e32ff2d.jpg',
        'sponsor_link': 'https://moscowzoo.ru/about/guardianship'
    },
    'Тигр': {
        'description': 'Вы - Тигр! Символ страсти, энергии и силы воли. '
                       'Люди-тигры смелы, энергичны и умеют концентрироваться на цели... Подробнее https://moscowzoo.ru/animals/kinds/amurskiy_tigr',
        'image': 'https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/71062cdc-ae27-432a-84ed-d3743afd903b.jpeg',
        'sponsor_link': 'https://moscowzoo.ru/about/guardianship'
    },
    'Жираф': {
        'description': 'Вы - Жираф! Символ дальновидности, грации и уникальности. '
                       'Люди-жирафы обладают широким кругозором, добротой и выделяются из толпы... Подробнее https://moscowzoo.ru/animals/kinds/yuzhnoafrikanskiy_zhiraf',
        'image': 'https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/be828df3-ec39-49b7-ace3-58f4a69bde57.jpg',
        'sponsor_link': 'https://moscowzoo.ru/about/guardianship'
    },
    'Питон': {
        'description': 'Вы - Питон! Символ гармонии, спокойствия и баланса. '
                       'Люди-питоны миролюбивы, добродушны и умеют находить радость в простых вещах... Подробнее https://moscowzoo.ru/animals/kinds/temnyy_tigrovyy_piton',
        'image': 'https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc/images/animals/c2a289a1-782f-4ae8-b2d4-3b85b86d4b3a.jpeg',
        'sponsor_link': 'https://moscowzoo.ru/about/guardianship'
    }
}


quiz_questions = [
    {
        'question': 'Как вы предпочитаете проводить свободное время?',
        'options': [
            'В компании друзей',
            'За чтением книг или саморазвитием',
            'Занимаясь творчеством',
            'На природе, в одиночестве',
            'Помогая другим',
            'Путешествуя и открывая новое'
        ],
        'weights': {
            'Лев': 1, 'Сова': 0, 'Енот': 3, 'Волк': 2,
            'Слон': 4, 'Орел': 5, 'Черепаха': 0, 'Пума': 3,
            'Медведь': 2, 'Тигр': 1, 'Жираф': 5, 'Питон': 4
        }
    },
    {
        'question': 'Как бы вас описали ваши друзья?',
        'options': [
            'Прирожденный лидер',
            'Мудрый и спокойный',
            'Душа компании',
            'Надежный и преданный',
            'Терпеливый и заботливый',
            'Проницательный и независимый'
        ],
        'weights': {
            'Лев': 3, 'Сова': 1, 'Енот': 2, 'Волк': 2,
            'Слон': 4, 'Орел': 5, 'Черепаха': 1, 'Пума': 5,
            'Медведь': 4, 'Тигр': 3, 'Жираф': 2, 'Питон': 0
        }
    },
    {
        'question': 'Ваша главная черта характера?',
        'options': [
            'Решительность',
            'Уравновешенность',
            'Оптимизм',
            'Интуиция',
            'Надежность',
            'Любознательность'
        ],
        'weights': {
            'Лев': 3, 'Сова': 2, 'Енот': 1, 'Волк': 2,
            'Слон': 4, 'Орел': 5, 'Черепаха': 2, 'Пума': 3,
            'Медведь': 0, 'Тигр': 3, 'Жираф': 5, 'Питон': 1
        }
    },
    {
        'question': 'Как вы реагируете на проблемы?',
        'options': [
            'Беру ответственность на себя',
            'Анализирую и ищу лучшее решение',
            'Ищу поддержки у друзей',
            'Полагаюсь на свою интуицию',
            'Действую методично и терпеливо',
            'Ищу нестандартный подход'
        ],
        'weights': {
            'Лев': 3, 'Сова': 2, 'Енот': 1, 'Волк': 2,
            'Слон': 4, 'Орел': 5, 'Черепаха': 4, 'Пума': 5,
            'Медведь': 3, 'Тигр': 0, 'Жираф': 2, 'Питон': 1
        }
    },
    {
        'question': 'Что для вас самое важное в жизни?',
        'options': [
            'Власть и уважение',
            'Знания и мудрость',
            'Радость и удовольствие',
            'Семья и близкие',
            'Стабильность и безопасность',
            'Свобода и приключения'
        ],
        'weights': {
            'Лев': 0, 'Сова': 1, 'Енот': 2, 'Волк': 3,
            'Слон': 4, 'Орел': 5, 'Черепаха': 4, 'Пума': 2,
            'Медведь': 3, 'Тигр': 0, 'Жираф': 5, 'Питон': 1
        }
    },
    {
        'question': 'Ваш подход к работе?',
        'options': [
            'Лидерство и контроль',
            'Анализ и планирование',
            'Творчество и вдохновение',
            'Интуиция и гибкость',
            'Методичность и терпение',
            'Инновации и эксперименты'
        ],
        'weights': {
            'Лев': 0, 'Сова': 1, 'Енот': 2, 'Волк': 3,
            'Слон': 4, 'Орел': 5, 'Черепаха': 4, 'Пума': 5,
            'Медведь': 3, 'Тигр': 0, 'Жираф': 2, 'Питон': 1
        }
    },
    {
        'question': 'Как вы ведете себя в конфликте?',
        'options': [
            'Беру инициативу в свои руки',
            'Сохраняю хладнокровие',
            'Стараюсь разрядить обстановку',
            'Прислушиваюсь к интуиции',
            'Проявляю терпение и выдержку',
            'Ищу нестандартный выход'
        ],
        'weights': {
            'Лев': 0, 'Сова': 1, 'Енот': 2, 'Волк': 3,
            'Слон': 4, 'Орел': 1, 'Черепаха': 4, 'Пума': 5,
            'Медведь': 0, 'Тигр': 0, 'Жираф': 2, 'Питон': 1
        }
    },
    {
        'question': 'Ваше отношение к риску?',
        'options': [
            'Иду на риск уверенно',
            'Тщательно взвешиваю все за и против',
            'Рискую ради веселья',
            'Рискую, если чувствую, что нужно',
            'Избегаю ненужных рисков',
            'Рискую ради новых впечатлений'
        ],
        'weights': {
            'Лев': 0, 'Сова': 4, 'Енот': 2, 'Волк': 3,
            'Слон': 5, 'Орел': 1, 'Черепаха': 5, 'Пума': 3,
            'Медведь': 4, 'Тигр': 0, 'Жираф': 1, 'Питон': 4
        }
    },
    {
        'question': 'Как вы принимаете решения?',
        'options': [
            'Быстро и уверенно',
            'На основе анализа',
            'По настроению',
            'По наитию',
            'После долгих раздумий',
            'Ищу оригинальные решения'
        ],
        'weights': {
            'Лев': 0, 'Сова': 1, 'Енот': 2, 'Волк': 3,
            'Слон': 4, 'Орел': 1, 'Черепаха': 4, 'Пума': 5,
            'Медведь': 3, 'Тигр': 0, 'Жираф': 2, 'Питон': 1
        }
    },
    {
        'question': 'Какое качество вы больше всего цените в других?',
        'options': [
            'Силу характера',
            'Мудрость',
            'Чувство юмора',
            'Преданность',
            'Надежность',
            'Оригинальность'
        ],
        'weights': {
            'Лев': 0, 'Сова': 1, 'Енот': 2, 'Волк': 3,
            'Слон': 4, 'Орел': 1, 'Черепаха': 4, 'Пума': 5,
            'Медведь': 3, 'Тигр': 0, 'Жираф': 5, 'Питон': 2
        }
    }
]